postfix/ex1.tex
% Created 2013-09-20 Fri 08:57
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage[normalem]{ulem}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{amstext}
\usepackage{hyperref}
\tolerance=1000
\usepackage{ntheorem}
\usepackage{tikz}
\usepackage{tikz-cd}
\usetikzlibrary{matrix,arrows,positioning,scopes,chains}
\tikzset{node distance=2cm, auto}
\author{The Team of Fu}
\date{\today}
\title{Postfix}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.0)}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec-1}
\begin{description}
\item[{Remark}] This is a literate program.
\footnote{See \url{http://en.wikipedia.org/wiki/Literate_programming}.}
Source code \emph{and} PDF documentation spring
from the same, plain-text source files.
\end{description}

\begin{figure}[H]
\label{project-file}
\begin{verbatim}
(defproject ex1 "0.1.0-SNAPSHOT"
  :description "Project Fortune's Postfix Expression Evaluator"
  :url "http://example.com/TODO"
  :license {:name "TODO"
            :url "TODO"}
  :dependencies [[org.clojure/clojure  "1.5.1"]
                ]
  :repl-options {:init-ns ex1.core})
\end{verbatim}
\end{figure}
\section{The Namespace}
\label{sec-2}

\begin{figure}[H]
\label{main-namespace}
\begin{verbatim}
(ns ex1.core)
\end{verbatim}
\end{figure}
\section{Functions}
\label{sec-3}

This \emph{postfix} function receives a sequence of expressions $es$. It
produces a reduction of a binary function $f$ over the empty vector
$[\;]$ and $es$. $f$ receives a vector $a$ and an expression $e$. $a$
implements a stack. If $e$ is a function, $f$ replaces the top two
elements $r$ and $l$ of $a$ with $e(l,r)$, the application of function
$e$ to those arguments. Otherwise, $f$ just \emph{cons}-es $e$ to the front
of $a$. $r$ and $l$ appear in opposite order in $a$ to the order that
$e$ receives them; while reducing arguments left-to-right in $es$,
\emph{postfix} reverses them when \emph{cons}-ing to the front of the stack.

\begin{figure}[H]
\label{main-postfix}
\begin{verbatim}
(defn postfix [& es]
  (reduce
    (fn f [a-vec e]
      (if (fn? e)
          (let [[r l & m] a-vec]
            (cons (e l r) m))
          (cons e a-vec)))
    []
    es))
\end{verbatim}
\end{figure}

\begin{figure}[H]
\label{main-functions}
\begin{verbatim}
(defn zero-out-divide-by-zero [fn l r]
  ; if function is division (/) and right-hand operand is 0
  (if (and
        (= fn /)
        (some #{r} [0 0.0 0M]))
    ; return operand
    r
    ; otherwise, execute function
    (fn l r)))

(defn binary-apply-fn [fn r l]
  (apply map (partial zero-out-divide-by-zero fn)
    (list r l)))

(defn postfix-collections [& e]
  (mapcat identity
    (reduce #(if (fn? %2)
               (let [[r l & m]%]
                 (cons (binary-apply-fn %2 l r) m))
               (cons %2 %))[]e)))
\end{verbatim}
\end{figure}
\section{Core Unit-Test File}
\label{sec-4}

\begin{figure}[H]
\label{main-test-namespace}
\begin{verbatim}
(ns ex1.core-test
  (:require [ex1.core :refer :all]
            [clojure.test :refer :all]
  ))
\end{verbatim}
\end{figure}

\begin{figure}[H]
\label{test-functions}
\begin{verbatim}
(deftest null-test
  (testing "null test"
    (is (= 1 1))))
\end{verbatim}
\end{figure}
\section{A REPL-based Solution}
\label{sec-5}
\label{sec:emacs-repl}
To run the REPL for interactive programming and testing in org-mode,
take the following steps:
\begin{enumerate}
\item Set up emacs and nRepl (TODO: explain; automate)
\item Edit your init.el file as follows (TODO: details)
\item Start nRepl while visiting the actual |project-clj| file.
\item Run code in the org-mode buffer with \verb|C-c C-c|; results of
evaluation are placed right in the buffer for inspection; they are
not copied out to the PDF file.
\end{enumerate}
% Emacs 24.3.1 (Org mode 8.0)
\end{document}
